{
  "meta": {
    "title": "swn.ski",
    "description": "Jakub Sowiński - solution architect, software developer, programming teacher, and technical leader"
  },
  "nav": {
    "home": "home",
    "articles": "articles",
    "blog": "blog",
    "courses": "courses",
    "projects": "projects",
    "talks": "talks"
  },
  "pages": {
    "home": {
      "intro": {
        "head": "Hello!",
        "lead": "My name is Jakub and I'm a software enthusiast. I work as a solution architect, software developer, programming teacher, and technical leader. Welcome to my corner of the Internet!",
        "text": "If you want to hire me, <a href=\"#contact\">drop me a message</a>. If you don't know yet that you want to hire me, please refer to my resume or read more about my work. Otherwise, enjoy fruits of my labor, such as my projects, talks, articles, courses, and blog posts, or just chill out here with me. Peace!",
        "buttons": {
          "cv": "My resume",
          "info": "More about my work",
          "contact": "Contact me"
        },
        "imgAlt": "Jakub Sowiński - solution architect, software developer, teacher and leader"
      },
      "architect": {
        "head": "Solution architect",
        "lead": "As an architect, it is my job to ensure that software not only is built properly, but even more so that it is being built properly.",
        "text": "I have over 5 years of experience in solution and software architecture positions, as well as over 3 years of experience as an university lecturer in software architecture. Drawing from my experience, I can help your project by bringing structure and technical guidance to its architectural design, but also to its software development and deployment processes. <a href=\"#contact\">Learn how!</a>",
        "buttons": {
          "talks": "My talks",
          "articles": "My articles"
        },
        "imgAlt": "Jakub Sowiński architecting"
      },
      "developer": {
        "head": "Software developer",
        "lead": "I started coding as a teenager and I never stopped since. In that time, I have dabbled in many programming languages, but ultimately I've fallen in love with web technologies, and especially JavaScript.",
        "text": "I have participated in plenty of programming conferences, contributed to handful of open source projects, even authored a couple of them, as well as wrote a couple of blog posts on web and JavaScript development, you can find them on this website. Or <a href=\"#contact\">reach out to me</a> if you have an interesting project and you need some help!",
        "buttons": {
          "projects": "My projects",
          "blog": "My blog"
        },
        "imgAlt": "Jakub Sowiński thinking about programming"
      },
      "leader": {
        "head": "Teacher and leader",
        "lead": "Throughout my career, I have been sharing knowledge and experience with my peers as a coach, mentor, teacher, trainer, public speaker, and leader of communities and projects.",
        "text": "Currently I work as a lecturer in software architecture at Polish-Japanese Academy of Information Technology in Warsaw, Poland, but I am open for other teaching and leading opportunities. <a href=\"#contact\">Reach out to me</a> if you're interested in one of my existing courses or you need something more specific and tailored to your needs!",
        "buttons": {
          "courses": "My courses"
        },
        "imgAlt": "Jakub Sowiński teaching and leading"
      },
      "contact": {
        "head": "Contact me",
        "lead": {
          "architect": "Want an architect or consultant for your business?",
          "developer": "Have an idea for an interesting and exciting project to collaborate on?",
          "teacher": "Need a software development or architecture training?",
          "leader": "Looking for a leader or mentor in IT?"
        }
      }
    },
    "articles": {
      "title": "Articles",
      "publishedBy": "published by"
    },
    "blog": {
      "title": "Blog"
    },
    "courses": {
      "title": "Courses",
      "courseContent": "Content:",
      "taughtFor": "taught for:",
      "buy": "Order this course"
    },
    "projects": {
      "title": "Projects",
      "stars": "stars",
      "forks": "forks",
      "installs": "installs"
    },
    "talks": {
      "title": "Talks",
      "slides": "slides",
      "recording": "recording",
      "noRecording": "No recording"
    },
    "cv": {
      "title": "Resume"
    },
    "error": {
      "404": {
        "name": "404",
        "description": "Page not found",
        "nextStep": "Go back to home page"
      },
      "500": {
        "name": "500",
        "description": "Internal server error",
        "nextStep": "Try again"
      }
    }
  },
  "misc": {
    "noJs": "Your browser does not support JavaScript",
    "continueReading": "Continue reading",
    "oneAvailableLang": "This content is only available in",
    "multipleAvailableLangs": "This content is available in",
    "availableLangs_en": "english",
    "availableLangs_pl": "polish",
    "and": "and",
    "allRightsReserved": "all rights reserved"
  }
}
