{
  "meta": {
    "title": "swn.ski",
    "description": "Jakub Sowiński - architekt rozwiązań, programista, nauczyciel programowania, techniczny lider"
  },
  "nav": {
    "home": "home",
    "articles": "artykuły",
    "blog": "blog",
    "courses": "szkolenia",
    "projects": "projekty",
    "talks": "wystąpienia"
  },
  "pages": {
    "home": {
      "intro": {
        "head": "Cześć!",
        "lead": "Jestem Jakub i interesuję się oprogramowaniem. Pracuję jako architekt rozwiązań, programista, nauczyciel programowania i techniczny lider. Witaj w moim zakątku Internetu!",
        "text": "Jeśli chcesz mnie zatrudnić, <a href=\"#contact\">wyślij mi wiadomość</a>. Jeśli jeszcze nie wiesz, że chcesz mnie zatrudnić, zapoznaj się z moim CV lub przeczytaj więcej na temat mojej pracy. W innym wypadku, zapraszam do korzystania z owoców mojej pracy, takich, jak moje projekty, wystąpienia, artykułu, szkolenia i wpisy na blogu. Peace!",
        "buttons": {
          "cv": "Moje CV",
          "info": "Więcej na temat mojej pracy",
          "contact": "Skontaktuj się ze mną"
        },
        "imgAlt": "Jakub Sowiński - architekt rozwiązań, programista, nauczyciel programowania, techniczny lider"
      },
      "architect": {
        "head": "Architekt rozwiązań",
        "lead": "Moim obowiązkiem jako architekta jest zapewnienie nie tylko tego, że oprogramowanie jest zbudowane poprawnie, ale przede wszystkim tego, że jest poprawnie budowane.",
        "text": "Mam ponad 5 lat doświadczenia na stanowiskach architekta rozwiązań i oprogramowania, a także ponad 3 lata doświadczenia jako wykładowca architektury oprogramowania na uczelni wyższej. Czerpiąc z tego doświadczenia, mogę pomóc w twoim projekcie przez organizację, zarządzanie i opiekę techinczną nad jego architekturą, ale także nad jego procesami wytwarzania i wdrażania oprogramowania. <a href=\"#contact\">Sprawdź jak!</a>",
        "buttons": {
          "talks": "Moje wystąpienia",
          "articles": "Moje artykuły"
        },
        "imgAlt": "Jakub Sowiński architektujący"
      },
      "developer": {
        "head": "Programista",
        "lead": "Programowaniem zacząłem się interesować jako nastolatek, i jak do tej pory nie przestałem. Przez ten czas eksperymentowałem z wieloma językami programowania, ale ostatecznie zakochałem się w technologiach webowych, a zwłaszcza JavaScript.",
        "text": "Uczestniczyłem w wielu konferencjach programistycznych, kontrybuowałem do kilku projektów open source, nawet sam stworzyłem kilka, napisałem również kilka poradników dotyczących programowania aplikacji webowych i JavaScriptu, możesz je znaleźć na tej stronie. Albo <a href=\"#contact\">napisz do mnie</a>, jeśli masz jakiś interesujący projekt, w którym mógłbym pomóc!",
        "buttons": {
          "projects": "Moje projekty",
          "blog": "Mój blog"
        },
        "imgAlt": "Jakub Sowiński myślący o programowaniu"
      },
      "leader": {
        "head": "Nauczyciel i lider",
        "lead": "Na przestrzeni mojej kariery, dzieliłem się wiedzą i doświadczeniem z moimi współpracownikami jako coach, mentor, nauczyciel, trener, mówca i lider społeczności oraz projektów.",
        "text": "Obecnie pracuję jako wykładowca architektury oprogramowania w Polsko-Japońskiej Akademii Technik Komputerowych w Warszawie, ale jestem otwarty na inne propozycje z zakresu dydaktyki i leadershipu. <a href=\"#contact\">Skontaktuj się ze mną</a> jeśli interesuje cię jedno z moich gotowych szkoleń, albo jeśli potrzebujesz czegoś bardziej dostosowanego do swoich potrzeb!",
        "buttons": {
          "courses": "Moje szkolenia"
        },
        "imgAlt": "Jakub Sowiński uczący i przewodzący"
      },
      "contact": {
        "head": "Napisz do mnie",
        "lead": {
          "architect": "Chcesz architekta lub konsultanta do jednego ze swoich projektów?",
          "developer": "Masz pomysł na interesujący i ekscytujący projekt i szukasz współpracowników?",
          "teacher": "Potrzebujesz szkolenia z zakresu programowania lub architektury?",
          "leader": "Szukasz lidera i mentora w IT?"
        }
      }
    },
    "articles": {
      "title": "Artykuły",
      "publishedBy": "opublikowano na łamach"
    },
    "blog": {
      "title": "Blog"
    },
    "courses": {
      "title": "Szkolenia",
      "courseContent": "Zawartość:",
      "taughtFor": "prowadzone dla:",
      "buy": "Zamów to szkolenie"
    },
    "projects": {
      "title": "Projekty",
      "stars": "gwiazdek",
      "forks": "forków",
      "installs": "instalacji"
    },
    "talks": {
      "title": "Wystąpienia",
      "slides": "slajdy",
      "recording": "nagranie",
      "noRecording": "Brak nagrania"
    },
    "cv": {
      "title": "CV"
    },
    "error": {
      "404": {
        "name": "404",
        "description": "Nie znaleziono strony",
        "nextStep": "Wróć do strony głównej"
      },
      "500": {
        "name": "500",
        "description": "Błąd serwera",
        "nextStep": "Spróbuj ponownie"
      }
    }
  },
  "misc": {
    "noJs": "Twoja przeglądarka nie wspiera JavaScript",
    "continueReading": "Czytaj dalej",
    "oneAvailableLang": "Ta treść jest dostępna tylko w języku",
    "multipleAvailableLangs": "Ta treść jest dostępna w językach",
    "availableLangs_en": "angielskim",
    "availableLangs_pl": "polskim",
    "and": "i",
    "allRightsReserved": "wszelkie prawa zastrzeżone"
  }
}
