[
  {
    "title": "Micro frontends revisited",
    "description": "At Stepstone we face an interesting, technical challenge: how to build a single, global platform for a collection of distinct, separate job board brands to run on. In this talk, we will explore our learnings from a couple of years of experience with micro frontend architecture as a potential solution to this challenge.",
    "date": "2023-06",
    "langs": ["en"],
    "event": "Axel Springer Media & Tech 2023",
    "place": {
      "en": "Berlin, Germany",
      "pl": "Berlin, Niemcy"
    },
    "recording": {
      "youtube": "Yac9wgicbUM"
    },
    "inCV": "true"
  },
  {
    "title": "Micro frontends: extending service-oriented architecture to front-end development",
    "description": "With the ongoing transformation of StepStone's core application from monolithic to a service-oriented architecture, our frontend developers faced new challenge – how to implement a user interface in this new landscape of distributed systems. We decided to adapt the concept of micro frontends, which is service-oriented approach to frontend development. In this talk, I'll explain our reasoning behind this choice, show how we enhanced our software engineering processes in order to implement micro frontend approach, and share most valuable lessons we've learned during this journey.",
    "date": "2019-08",
    "langs": ["en"],
    "event": "Devoxx Poland 2019",
    "place": {
      "en": "Cracow, Poland",
      "pl": "Kraków, Polska"
    },
    "recording": {
      "youtube": "Il9O2vchlRg"
    },
    "slides": "microfrontends",
    "inCV": "true"
  },
  {
    "title": "Micro frontends: extending service-oriented architecture to front-end development",
    "description": "With the ongoing transformation of StepStone's core application from monolithic to a service-oriented architecture, our frontend developers faced new challenge – how to implement a user interface in this new landscape of distributed systems. We decided to adapt the concept of micro frontends, which is service-oriented approach to frontend development. In this talk, I'll explain our reasoning behind this choice, show how we enhanced our software engineering processes in order to implement micro frontend approach, and share most valuable lessons we've learned during this journey.",
    "date": "2019-07",
    "langs": ["en"],
    "event": "Infoshare 2019",
    "place": {
      "en": "Gdansk, Poland",
      "pl": "Gdańsk, Polska"
    },
    "recording": {
      "youtube": "lkl_C3CObp0"
    },
    "slides": "microfrontends",
    "inCV": "true"
  },
  {
    "title": "How to improve code quality with property-based testing",
    "description": "I was first introduced to the idea of property-based testing when I was attending Front-end Connect in December of 2018. I've found this concept extremely interesting, I was even asking myself, why are we not doing this? Why is it not an industry standard? Finally, after almost a year of tinkering with property-based tests in multiple programming languages, I have an opportunity to talk about my discoveries during first edition of StepStone Tech Meetup in 2019. Let me tell you why I've found this concept revolutionary, and why I now understand, why we're not doing this.",
    "date": "2019-10",
    "langs": ["pl"],
    "event": "StepStone Tech Meetup #1 2019",
    "place": {
      "en": "Warsaw, Poland",
      "pl": "Warszawa, Polska"
    },
    "slides": "property_based_tests"
  },
  {
    "title": "3 lata życia aplikacji w React i TypeScript: lekcje i wnioski",
    "description": "To nie będzie typowe, krótkoterminowe, krótkowzroczne case study. Podczas tego wystąpienia pokażę wam pierwszą aplikację napisaną w React i TypeScript w mojej firmie, opowiem o jej perypetiach przez 3 lata życia na produkcji, oraz o lekcjach i wnioskach jakie wyciągnęliśmy z naszych doświadczeń przez ten czas. Których decyzji technicznych żałujemy najbardziej? Które miały najdalej idące konsekwencje? Jak nasza architektura sprostała próbie czasu? Jak zniosła rozbudowę aplikacji o pierwotnie zupełnie nieoczekiwane funkcjonalności? Jak zapewniliśmy jej stabilność poprzez rozszerzanie testowania i monitoringu? Przekonajmy się o tym razem.",
    "date": "2019-06",
    "langs": ["pl"],
    "event": "4Developers 2019",
    "place": {
      "en": "Warsaw, Poland",
      "pl": "Warszawa, Polska"
    },
    "recording": {
      "youtube": "aQw3jpVsf6w"
    },
    "slides": "profile_editor_case_study"
  },
  {
    "title": "Mikro front-endy: continous delivery w dużych projektach",
    "description": "W związku z trwającą w mojej firmie transformacją architektury głównej platformy z monolitycznej do zorientowanej serwisowo, jako front-end developerzy stanęliśmy przed nie lada wyzwaniem: jak efektywnie implementować interfejsy w tym nowym, rozproszonym świecie? Tak zaczęła się nasza przygoda z ideą mikro front-endów. Podczas tego wystąpienia pokażę wam na czym ta idea polega, dlaczego to na nią padł wybór, w jaki sposób ją implementujemy, oraz w jaki sposób przy jej pomocy progresywnie ulepszamy nasz proces wytwarzania oprogramowania tak, aby osiągnąć i zachować continous delivery front-endu.",
    "date": "2019-06",
    "langs": ["pl"],
    "event": "4Developers 2019",
    "place": {
      "en": "Warsaw, Poland",
      "pl": "Warszawa, Polska"
    },
    "recording": {
      "youtube": "j-1i05AMBB8"
    },
    "slides": "microfrontends"
  },
  {
    "title": "Autostopem przez PWA",
    "description": "Kiedy zostałem zaproszony przez mojego przyjaciela Dawida aby wystąpić na pierwszej edycji organizowanego przez niego meetupu, oczywiście od razu się zgodziłem. Zapytałem go później: \"Dawid, ale ty pracujesz jako tester aplikacji mobilnych i organizujesz meetup o testowaniu aplikacjach mobilnych, a ja robię web development. O czym ja mam tam opowiedzieć\". Dawid odparł natychmiast: \"PWA\". To prawda, znam się na PWA... Ale czy znam się na zautomatyzowanym testowaniu PWA? Otóż okazuje się, że tak.",
    "date": "2019-06",
    "langs": ["pl"],
    "event": "AppQa Meetup #1 2019",
    "place": {
      "en": "Warsaw, Poland",
      "pl": "Warszawa, Polska"
    },
    "slides": "pwa_testing"
  },
  {
    "title": "Modern web development: React PWA with Push Notifications (case study)",
    "description": "You've heard about Progressive Web Apps, Push Notifications and all the other, cool features, present in modern browsers nowadays, and available for modern web development. Have you seen them in action, though? In this talk I will discuss transformation of React web application to fully functional Progressive Web App, based on two, real life examples - small, private website, and complex, commercial web application. We'll go together through baseline PWA checklist, and dive deep into more detailed aspects of this process, such as performance improvements, caching with Service Workers, sending Push Notifications, and others. We'll explore, how experience of users of commercially available products is improved by making them more Progressive.",
    "date": "2017-11",
    "langs": ["en"],
    "event": "Code Europe Autumn 2017",
    "place": {
      "en": "Warsaw, Poland",
      "pl": "Warszawa, Polska"
    },
    "recording": {
      "youtube": "n1Be_RzXzjQ"
    },
    "slides": "pwa_case_study",
    "inCV": "true"
  },
  {
    "title": "Practical tips for JavaScript optimisation",
    "description": "With gain of popularity of JS-based web applications and growth of mobile web traffic, need for optimization of JavaScript code increases. I will present several techniques that can help satisfying this need, from the architecture of your application, through bundling and compile-time enhancements, to caching with service workers.",
    "date": "2017-07",
    "langs": ["en"],
    "event": "Code Europe Spring 2017",
    "place": {
      "en": "Warsaw, Poland",
      "pl": "Warszawa, Polska"
    },
    "recording": {
      "youtube": "Gl8vucNqtZQ"
    },
    "slides": "optimizing_js",
    "inCV": "true"
  }
]
